/* Используйте цикл while для нахождения суммы всех нечётных чисел от 1 до 20.
  Результат вычислений сохраните в переменной sum.

  Вам понадобиться оператор остатка от деления %. Например, выражение 5 % 2 вернёт остаток 1.
*/

// your code
/*
let sum = 0;
let i = 1;

if(count%2)
       summ+=count;
    }while(count++<99);

while (count%2) {
  console.log(`Текущее число: ${sum + i}`)

  if ( i<= 20) {
    
  } else if (i === 20) {

  } else {

  }
  num++;
} 
console.log(`Итоговая сумма: ${sum + i}`);


/*for (let i = 1; i < 20; i++) {
  if (i % 2 !== 0) {
    console.log(i);
  }
}